* Installation git-lfs on ubuntu
#+BEGIN_SRC sh :dir /sudo:: :results output
curl -s https://packagecloud.io/install/repositories/github/git-lfs/script.deb.sh | sudo bash
sudo apt-get install git-lfs
git lfs install

#+END_SRC

#+RESULTS:
#+begin_example
Detected operating system as Ubuntu/xenial.
Checking for curl...
Detected curl...
Running apt-get update... done.
Installing apt-transport-https... done.
Installing /etc/apt/sources.list.d/github_git-lfs.list...done.
Importing packagecloud gpg key... done.
Running apt-get update... done.

The repository is setup! You can now install packages.
Reading package lists... 0%Reading package lists... 100%Reading package lists... Done
Building dependency tree... 0%Building dependency tree... 0%Building dependency tree... 50%Building dependency tree... 50%Building dependency tree       
Reading state information... 0%Reading state information... 0%Reading state information... Done
The following NEW packages will be installed:
  git-lfs
0 upgraded, 1 newly installed, 0 to remove and 84 not upgraded.
Need to get 2,383 kB of archives.
After this operation, 9,961 kB of additional disk space will be used.
0% [Working]0% [Working]0% [Working]0% [Working]0% [Working]            Get:1 https://packagecloud.io/github/git-lfs/ubuntu xenial/main amd64 git-lfs amd64 1.5.5 [2,383 kB]
0% [1 git-lfs 0 B/2,383 kB 0%]22% [1 git-lfs 655 kB/2,383 kB 27%]65% [1 git-lfs 1,933 kB/2,383 kB 81%]                                     100% [Working]              Fetched 2,383 kB in 3s (702 kB/s)
Selecting previously unselected package git-lfs.
(Reading database ... (Reading database ... 5%(Reading database ... 10%(Reading database ... 15%(Reading database ... 20%(Reading database ... 25%(Reading database ... 30%(Reading database ... 35%(Reading database ... 40%(Reading database ... 45%(Reading database ... 50%(Reading database ... 55%(Reading database ... 60%(Reading database ... 65%(Reading database ... 70%(Reading database ... 75%(Reading database ... 80%(Reading database ... 85%(Reading database ... 90%(Reading database ... 95%(Reading database ... 100%(Reading database ... 346629 files and directories currently installed.)
Preparing to unpack .../git-lfs_1.5.5_amd64.deb ...
Unpacking git-lfs (1.5.5) ...
Processing triggers for man-db (2.7.5-1) ...
Setting up git-lfs (1.5.5) ...
Git LFS initialized.
Git LFS initialized.
#+end_example


* How to disable color in git
git -c color.status=false status
